{"metadata":{"title":"Using Notion Formulas to Calculate Weight","date":"Aug 16, 2019","excerpt":"Customizing a marketplace template to document all of my outdoor gear in a (potentially overengineered?) Notion database.","category":"notion"},"content":"<p>Over the weekend, I decided to formally document all of my backpacking, camping, hiking, and climbing gear. I wanted to create a centralized tracker for a few reasons, the most important few being:</p>\n<ul>\n<li>Figuring out when it's time to replace a piece of gear, based on the length of time I've owned it and condition it's currently in</li>\n<li>Tracking the weight of my pack, dependent on trip type (i.e. backpacking trips require different gear than day hikes)</li>\n</ul>\n<p>I haven't used Notion as an inventory source for my possessions before, so I browsed the <a href=\"https://www.notion.so/Notion-Template-Gallery-181e961aeb5c4ee6915307c0dfd5156d\">template gallery</a> for inspiration. This <a href=\"https://www.notion.so/Plant-tracker-faafcfcf6a9d4f10b579d9351ecaaebc\">plant tracker</a> from <a href=\"https://twitter.com/yuemaggie\">@maggieyue</a> looked like a good template to duplicate for something like this, so I went for it. I made a few changes to the plant tracker (while also maintaining a separate duplicate of the plant tracker for <a href=\"https://www.notion.so/kalestew/Plants-3e733a7a27e248c79f22042032411a7b\">my own plants</a> because this template is awesome), but overall I found it served my needs very well.</p>\n<h2>Changes Made</h2>\n<p>I only made a handful of changes transitioning the <a href=\"https://www.notion.so/Plant-tracker-faafcfcf6a9d4f10b579d9351ecaaebc\">Plant Tracker</a> into a <a href=\"https://www.notion.so/kalestew/abebdb4997514ef8882e13b1d00baebf?v=6691b68442e64533a85138d04b75912d\">Gear Tracker</a>.</p>\n<p>Properties I kept</p>\n<ul>\n<li><code>Acquisition Date</code> - I found this could represent the same piece of data for both tables</li>\n<li><code>Name</code> - as an identifying column, it doesn't get much simpler than a simple name</li>\n<li><code>Visual</code> - attaching an image of the item is a nice organizational step</li>\n<li><code>Care &#x26; Notes</code> - turned into just a plain <code>Notes</code> but kept it for quick reminders</li>\n</ul>\n<p>Properties I added</p>\n<ul>\n<li><code>URL</code> - a link to the product or the latest version of the product, if applicable</li>\n<li><code>Weight (oz)</code> - I've found it's easier to obtain a weight in ounces and then convert it to pounds, but this might not be the case for a different variety of item you are trying to inventory</li>\n<li><code>Weight (lb)</code> - a formula that relates to the weight in ounces and divides it by 16, so I can sum both columns separately</li>\n<li><code>Category</code> - options include <code>Backpacking</code>, <code>Car Camping</code>, <code>Day Hike</code>, etc. - allows me to sort items by trip type (see <a href=\"#views\">Views</a> for more details)</li>\n</ul>\n<p>Properties I got rid of</p>\n<ul>\n<li><code>Botanical Name</code>, <code>Date Watered</code>, <code>Date Fertilized</code>, and <code>Water Propogation</code> - for obvious reasons</li>\n<li><code>Location</code> and <code>Location Notes</code> - the location of my gear when I'm not using it doesn't matter quite as much as it does with plants</li>\n</ul>\n<h2>Views</h2>\n<p>Hinging around the <code>Category</code> property, I've created a few different views of this Gear table to serve as a packing list of sorts for various activities.</p>\n<p>When one navigates to the view, it's filtered down to the appropriate category and I've hidden that property column entirely to clean up the view.</p>\n<h2>In Conclusion</h2>\n<p>It's very simple to appropriate a template for your own uses, if you're willing to make some small changes. Thanks to flexibility of databases within Notion, it's also very simple to change the way you consume that data.</p>\n<p>Thanks for reading about my Gear Tracker and the approach I took to get here! Check out <a href=\"https://www.kyliestewart.tech/blog\">my other Notion posts</a> for more organizational fun.</p>"}